<?php
    //定義好我寫完的題目，動態輸出已完成項目
    $questionArr = [3,4,8,27,29,34,47];
    //uncompleted:4,33,53,56,69,74,81,84,94,96,97

    $questionTitleArr = [
        3 => '統一發票對獎',
        4 => '大樂透，從1~42號選出六個不重覆數字',
        8 => '華氏與攝氏換算計算機',
        19 => '輸入字串，切割之並顯示其 ASCII code',
        27 => '使用者輸入1~3000，判斷是否是閏年',
        29 => '輸入1~9999999的數字，並轉換成中文大寫字樣',
        33 => '輸入生日，判斷實歲和星座',
        34 => '電話公司的計方式',
        47 => '九九乘法表',
        53 => '隨機產生1~100數字，讓使用者猜',
        56 => '取火柴遊戲，取到最後一根的為輸家',
        69 => '設計十進位計算程式，具有任意位數精確度的正整數加法與乘法',
        74 => '計算文字檔內字元(中文視為一個字元)',
        81 => '比較兩陣列，計算相同元素',
        84 => '輸出萬年曆',
        94 => '將兩個文字檔串接起來，合成一個檔',
        96 => '輸入int，並判斷哪些字元是1',
        97 => '輸入字串，並刪去空白字元並輸出',
    ];

    $counter = count($questionArr)-1;
    for($i=0;$i<=$counter;$i++)
    {
        echo "
                <tr>
                    <td>".$questionArr[$i].". ".$questionTitleArr[$questionArr[$i]]."</td>
                    <td>
                        <a target='display' href='./question".$questionArr[$i].".php'>
                            <button class='buttonRadius10'>進入</button>
                        </a>
                    </td>
                </tr>
            ";
    }
?>